Revit 2027 API
ConnectorElement.Height Property
The height of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual double Height { get; }
Public Overridable ReadOnly Property Height As Double
	Get
public:
virtual property double Height {
	double get ();
}
abstract Height : float with get
override Height : float with get
Property Value
Double
Implements
IConnector.Height
Remarks
-1 if the connector is round.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace